/**
 * У нас есть фабрика монстров, с помощью которой мы каждый день выпускаем на улицы города разных
 * монстров. У каждого монстра есть следующие свойства: имя, тип, размер, наличие крыльев/зубов/тентаклей
 * и описание. Также есть общее свойство final с описанием фабрики. У фабрики есть геттеры и
 * сеттеры соответственно. Нужно:
 *
 * Создать класс для этой фабрики и вывести ее описание через свойство класса
 * Выпустить на улицы города 2 монстров с разными свойствами, полностью созданных через конструктор
 * Выпустить на улицы города еще 2 монстров, задав все свойства через конструктор
 * Убить одного из монстров
 * Изменить размер одного из монстров
 */

public class MonsterProductionUnit {
}
